app/Controllers/Housepital.php

    public function pasien()
    {
        $session = \Config\Services::session();
        $data['session'] = $session;


        $pasien = $this->PasienModel->findAll();
---
SELECT *
FROM `pasien`