app/Models/PasienModel.php

    public function getIdpasien($id_pasien)
    {
        return $this->where(['id_pasien' => $id_pasien])->first();
---
SELECT *
FROM `pasien`
WHERE `id_pasien` = ' 11'
 LIMIT 1